/*
 * main.c
 *
 * Created: 28.12.2021 18:37:35
 * Author : Michael
 */ 

#include <avr/io.h>
#define F_CPU 16000000
#include <util/delay.h>

#define DEV_ADDR 0b1100000 //адрес модуля по умолчанию
#define W 0 //признак записи данных в матрицу
#define R 1 //признак чтения данных из матрицы

//регистр состояния диодов столбца
#define COLUMN_DATA_REG 0x01
//регистр обновления состояния диодов столбца
#define UPDATE_COLUMN_REG 0x0C

void twi_start();
void twi_stop();
void twi_write(uint8_t data);
void matr_draw_pict(uint8_t dev_addr, uint8_t *data_buf);
void matr_init(uint8_t dev_addr);

int main(void)
{
  uint8_t pict[] = {0b00111100, 0b01000010, 0b10011001, 0b10100001, 0b10100001, 0b10011001, 0b01000010, 0b00111100}; //рисунок – значок копирайта ©
  uint8_t pict1[][9] ={{0b10011101, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001},
	                   {0b10011101, 0b10011101, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001},
					   {0b10000001, 0b10011101, 0b10011101, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001}, 
					   {0b10000001, 0b10000001, 0b10011101, 0b10011101, 0b10000001, 0b10000001, 0b10000001, 0b10000001},	
                       {0b10000001, 0b10000001, 0b10000001, 0b10011101, 0b10011101, 0b10000001, 0b10000001, 0b10000001},
                       {0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10011101, 0b10011101, 0b10000001, 0b10000001},
                       {0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10011101, 0b10011101, 0b10000001},
                       {0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10011101, 0b10011101},
					   {0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10000001, 0b10011101}};
  uint8_t pict2[][14] ={{0b00000001, 0b00000010, 0b00000100, 0b00001000, 0b00010000, 0b00100000, 0b01000000, 0b10000000},
					    {0b00000010, 0b00000100, 0b00001000, 0b00010000, 0b00100000, 0b01000000, 0b10000000, 0b01000000},
					    {0b00000100, 0b00001000, 0b00010000, 0b00100000, 0b01000000, 0b10000000, 0b01000000, 0b00100000},
					    {0b00001000, 0b00010000, 0b00100000, 0b01000000, 0b10000000, 0b01000000, 0b00100000, 0b00010000},
					    {0b00010000, 0b00100000, 0b01000000, 0b10000000, 0b01000000, 0b00100000, 0b00010000, 0b00001000},
					    {0b00100000, 0b01000000, 0b10000000, 0b01000000, 0b00100000, 0b00010000, 0b00001000, 0b00000100},
					    {0b01000000, 0b10000000, 0b01000000, 0b00100000, 0b00010000, 0b00001000, 0b00000100, 0b00000010},
					    {0b10000000, 0b01000000, 0b00100000, 0b00010000, 0b00001000, 0b00000100, 0b00000010, 0b00000001},
					    {0b01000000, 0b00100000, 0b00010000, 0b00001000, 0b00000100, 0b00000010, 0b00000001, 0b00000010},
					    {0b00100000, 0b00010000, 0b00001000, 0b00000100, 0b00000010, 0b00000001, 0b00000010, 0b00000100},
					    {0b00010000, 0b00001000, 0b00000100, 0b00000010, 0b00000001, 0b00000010, 0b00000100, 0b00001000},
					    {0b00001000, 0b00000100, 0b00000010, 0b00000001, 0b00000010, 0b00000100, 0b00001000, 0b00010000},
					    {0b00000100, 0b00000010, 0b00000001, 0b00000010, 0b00000100, 0b00001000, 0b00010000, 0b00100000},	     
					    {0b00000010, 0b00000001, 0b00000010, 0b00000100, 0b00001000, 0b00010000, 0b00100000, 0b01000000},
						{0b00000001, 0b00000010, 0b00000100, 0b00001000, 0b00010000, 0b00100000, 0b01000000, 0b10000000}};
  matr_init(DEV_ADDR);
  while (1)
  {
	matr_draw_pict(DEV_ADDR, pict);
	_delay_ms(2000);
	for(uint8_t j=0; j<=9; j++)
	{
		for(uint8_t i=0; i<=13; i++)
		{
			matr_draw_pict(DEV_ADDR, pict2[i]);
			_delay_ms(75);
		}	
	}
	for(uint8_t j=0; j<=7; j++)
	{
		for(uint8_t i=0; i<=8; i++)
		{
			matr_draw_pict(DEV_ADDR, pict1[i]);
			_delay_ms(75);
		}
		for(uint8_t i=0; i<=8; i++)
		{
			matr_draw_pict(DEV_ADDR, pict1[8-i]);
			_delay_ms(75);
		}
	}
  }
}

void twi_start(void) //состояние СТАРТ
{
  TWCR = (1<<TWINT) | (1<<TWSTA) | (1<<TWEN);
  while(!(TWCR & (1<<TWINT)));
}
void twi_stop(void) //состояние СТОП
{
  TWCR = (1<<TWINT) | (1<<TWEN) | (1<<TWSTO);
}
void twi_write(uint8_t data) //передача данных в матрицу
{
  TWDR = data;
  TWCR = (1<<TWINT) | (1<<TWEN);
  while(!(TWCR & (1<<TWINT)));
}
//передача изображения по столбцам на матрицу с МК
void matr_draw_pict(uint8_t dev_addr, uint8_t *data_buf)
{
  uint8_t i;
  twi_start();
  twi_write((dev_addr<<1) | W);
  for(i = 0; i <= 7; i++)
  {
    //очередную часть рисунка кладём в очередной регистр
    twi_write(COLUMN_DATA_REG+i);
    twi_write(data_buf[i]);
  }
  //чтобы рисунок был выведен, обновляем регистр 0x0C
  twi_write(UPDATE_COLUMN_REG);
  twi_write(0xFF);
  twi_stop();
}

void matr_init(uint8_t dev_addr)
{
  TWBR = 32; //200 кГц частота обмена
  /* настройки по умолчанию (матрица 8х8, без 
  эквалайзера, 40мА тока) нам подходят, поэтому ничего 
  не меняем и не перенастраиваем */
}